04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/reverseBurner/constant/gas/reactionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/gas";
    object      reactionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

reactionModel PaSR;

PaSR
{
    Cmix                1.0;
}

// ************************************************************************* //
