04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/reverseBurner/system/gas/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/gas";
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type            fixedTemperature;

    cellZone
    {
        type        box;
        zoneType    cell;
        box         (0.01 0.1 -0.01) (0.02 0.11 0.01);
    }

    mode            uniform;

    temperature     2000;

    fraction
    {
        type            table;
        values          ((0 0) (0.1 0) (0.2 1) (0.4 1) (0.5 0));
    }
}

// ************************************************************************* //
